emsesp/EMS-ESP32/src/core/analogsensor.cpp
    // if the sensor exists and we're using HA, delete the old HA record
    if (found_sensor && Mqtt::ha_enabled()) {
        remove_ha_topic(type, gpio); // the GPIO
    }

    // we didn't find it, it's new, so create and store it in the customization list
    if (!found_sensor) {
        found_sensor = true;
        EMSESP::webCustomizationService.update([&](WebCustomization & settings) {
            auto newSensor = AnalogCustomization();
            newSensor.gpio = gpio;
            strlcpy(newSensor.name, name, sizeof(newSensor.name));
            newSensor.offset    = offset;
            newSensor.factor    = factor;
            newSensor.uom       = uom;
            newSensor.type      = type;
            newSensor.is_system = is_system;
            settings.analogCustomizations.push_back(newSensor);
            // check the gpio again and add to used list
            if (EMSESP::system_.add_gpio(gpio, name)) {
                LOG_DEBUG("Adding customization for analog sensor GPIO %02d", gpio);
                return StateUpdateResult::CHANGED; // persist the change
            } else {
                found_sensor = false;
                return StateUpdateResult::ERROR; // if we can't add the GPIO, return an error
            }
        });
    }

    // reloads the sensors in the customizations file into the sensors list
    if (found_sensor) {
        reload();
    }

    return found_sensor;
}

// check to see if values have been updated
bool AnalogSensor::updated_values() {
    if (changed_ && Mqtt::publish_queued() == 0) {
        changed_ = false;
        return true;
    }
    return false;
}

// publish a single sensor to MQTT
void AnalogSensor::publish_sensor(const Sensor & sensor) const {
    if (Mqtt::publish_single()) {
        char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];
        if (Mqtt::publish_single2cmd()) {
            snprintf(topic, sizeof(topic), "%s/%s", F_(analogsensor), sensor.name());
        } else {
            snprintf(topic, sizeof(topic), "%s%s/%s", F_(analogsensor), "_data", sensor.name());
        }
        char result[12];
        if (sensor.type() == AnalogType::DIGITAL_IN || sensor.type() == AnalogType::DIGITAL_OUT) {
            Helpers::render_boolean(result, sensor.value() != 0);
        } else {
            Helpers::render_value(result, sensor.value(), 2); // double
        }
        Mqtt::queue_publish(topic, result); // always publish as doubles
    }
    char cmd[COMMAND_MAX_LENGTH];
    snprintf(cmd, sizeof(cmd), "%s/%s", F_(analogsensor), sensor.name());
    EMSESP::webSchedulerService.onChange(cmd);
}

// send empty config topic to remove the entry from HA
void AnalogSensor::remove_ha_topic(const int8_t type, const uint8_t gpio) const {
    if (!Mqtt::ha_enabled()) {
        return;
    }

    LOG_DEBUG("Removing HA config for analog sensor GPIO %02d", gpio);
    char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];

#if CONFIG_IDF_TARGET_ESP32
    if (type == AnalogType::PULSE || (type == AnalogType::DIGITAL_OUT && gpio != 25 && gpio != 26)) {
#elif CONFIG_IDF_TARGET_ESP32S2
    if (type == AnalogType::PULSE || (type == AnalogType::DIGITAL_OUT && gpio != 17 && gpio != 18)) {
#else
    if (type == AnalogType::PULSE || type == AnalogType::DIGITAL_OUT) {
#endif
        snprintf(topic, sizeof(topic), "switch/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else if (type == AnalogType::DIGITAL_OUT) { // DAC
        snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else if (type >= AnalogType::PWM_0 && type <= AnalogType::PWM_2) {
        snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else if (type == AnalogType::RGB) {
        snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else if (type == AnalogType::DIGITAL_IN) {
        snprintf(topic, sizeof(topic), "binary_sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    } else {
        snprintf(topic, sizeof(topic), "sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), gpio);
    }
    Mqtt::queue_remove_topic(topic);
}

// send all sensor values as a JSON package to MQTT
void AnalogSensor::publish_values(const bool force) {
    uint8_t num_sensors = sensors_.size();

    if (!Mqtt::enabled() || num_sensors == 0) {
        return;
    }

    if (force) {
        if (Mqtt::publish_single()) {
            for (const auto & sensor : sensors_) {
                publish_sensor(sensor);
            }
            return;
        } else if (!EMSESP::mqtt_.get_publish_onchange(0)) {
            return; // wait for first time period
        }
    }

    JsonDocument doc;
    JsonObject   obj            = doc.to<JsonObject>();
    bool         ha_dev_created = false;

    for (auto & sensor : sensors_) {
        if (Mqtt::is_nested()) {
            char       s[10];
            JsonObject dataSensor = obj[Helpers::smallitoa(s, sensor.gpio())].to<JsonObject>();
            dataSensor["name"]    = (const char *)sensor.name();
#if CONFIG_IDF_TARGET_ESP32
            if (sensor.type() == AnalogType::PULSE || (sensor.type() == AnalogType::DIGITAL_OUT && sensor.gpio() != 25 && sensor.gpio() != 26)) {
#else
            if (sensor.type() == AnalogType::PULSE || sensor.type() == AnalogType::DIGITAL_OUT) {
#endif
                Mqtt::add_value_bool(dataSensor, "value", sensor.value() != 0);
            } else {
                dataSensor["value"] = serialized(Helpers::render_value(s, sensor.value(), 2)); // double
            }
        } else if (sensor.type() == AnalogType::DIGITAL_IN || sensor.type() == AnalogType::DIGITAL_OUT || sensor.type() == AnalogType::PULSE) {
            Mqtt::add_value_bool(obj, (const char *)sensor.name(), sensor.value() != 0);
        } else {
            char s[10];
            obj[sensor.name()] = serialized(Helpers::render_value(s, sensor.value(), 2));
        }

