emsesp/EMS-ESP32/src/core/analogsensor.cpp
    // show all entity details of the command is entities
    if (!strcmp(cmd, F_(entities))) {
        for (const auto & sensor : sensors_) {
            get_value_json(output[sensor.name()].to<JsonObject>(), sensor);
        }
        return true;
    }

    if (!strcmp(cmd, F_(metrics))) {
        std::string metrics = get_metrics_prometheus();
        if (!metrics.empty()) {
            output["api_data"] = metrics;
            return true;
        }
        return false;
    }

    // this is for a specific sensor, return the value
    const char * attribute_s = Command::get_attribute(cmd);

    for (const auto & sensor : sensors_) {
        // match custom name or sensor GPIO
        if (cmd == Helpers::toLower(sensor.name()) || Helpers::atoint(cmd) == sensor.gpio()) {
            get_value_json(output, sensor);
            return Command::get_attribute(output, cmd, attribute_s);
        }
    }

    return false; // not found
}

// generate Prometheus metrics format from analog values
std::string AnalogSensor::get_metrics_prometheus() {
    std::string result;
    result.reserve(sensors_.size() * 140);
    char val[10];
    for (auto & sensor : sensors_) {
        result += (std::string) "# HELP emsesp_" + sensor.name() + " " + sensor.name();
        if (sensor.type() != AnalogType::DIGITAL_OUT && sensor.type() != AnalogType::DIGITAL_IN) {
            result += (std::string) ", " + EMSdevice::uom_to_string(sensor.uom());
        } else {
            result += (std::string) ", boolean";
        }
        result += (std::string) ", readable, visible";
        if (sensor.type() == AnalogType::COUNTER || sensor.type() == AnalogType::RGB || sensor.type() == AnalogType::PULSE
            || (sensor.type() >= AnalogType::DIGITAL_OUT && sensor.type() <= AnalogType::PWM_2)
            || (sensor.type() >= AnalogType::CNT_0 && sensor.type() <= AnalogType::CNT_2)) {
            result += (std::string) ", writable";
        }
        result += (std::string) "\n# TYPE emsesp_" + sensor.name() + " gauge\n";
        result += (std::string) "emsesp_" + sensor.name() + " ";
        if (sensor.type() != AnalogType::DIGITAL_OUT && sensor.type() != AnalogType::DIGITAL_IN) {
            result += (std::string)Helpers::render_value(val, sensor.value(), 2) + "\n";
        } else {
            result += (std::string)(sensor.value() == 0 ? "0\n" : "1\n");
        }
    }
    return result;
}

// note we don't add the device and state classes here, as we do in the custom entity service
void AnalogSensor::get_value_json(JsonObject output, const Sensor & sensor) {
    output["name"]      = (const char *)sensor.name();
    output["fullname"]  = (const char *)sensor.name();
    output["gpio"]      = sensor.gpio();
    output["type"]      = F_(number);
    output["analog"]    = FL_(list_sensortype)[sensor.type()];
    output["value"]     = sensor.value();
    output["readable"]  = true;
    output["writeable"] = sensor.type() == AnalogType::COUNTER || sensor.type() == AnalogType::RGB || sensor.type() == AnalogType::PULSE
                          || (sensor.type() >= AnalogType::DIGITAL_OUT && sensor.type() <= AnalogType::PWM_2)
                          || (sensor.type() >= AnalogType::CNT_0 && sensor.type() <= AnalogType::CNT_2);
    output["visible"]   = true;
    output["is_system"] = sensor.is_system();
    if (sensor.type() == AnalogType::COUNTER || (sensor.type() >= AnalogType::CNT_0 && sensor.type() <= AnalogType::CNT_2)) {
        output["min"]         = 0;
        output["max"]         = 4000000;
        output["start_value"] = sensor.offset();
        output["factor"]      = sensor.factor();
        output["uom"]         = EMSdevice::uom_to_string(sensor.uom());
    } else if (sensor.type() == AnalogType::ADC) {
        output["offset"] = sensor.offset();
        output["factor"] = sensor.factor();
        output["uom"]    = EMSdevice::uom_to_string(sensor.uom());
    } else if (sensor.type() == AnalogType::TIMER || sensor.type() == AnalogType::RATE) {
        output["factor"] = sensor.factor();
    } else if (sensor.type() >= AnalogType::PWM_0 && sensor.type() <= AnalogType::PWM_2) {
        output["frequency"] = sensor.factor();
        output["min"]       = 0;
        output["max"]       = 100;
        output["uom"]       = EMSdevice::uom_to_string(sensor.uom());
    } else if (sensor.type() == AnalogType::DIGITAL_OUT) {
        output["min"] = 0;
#if CONFIG_IDF_TARGET_ESP32
        output["max"] = sensor.gpio() == 25 || sensor.gpio() == 26 ? 255 : 1;
#elif CONFIG_IDF_TARGET_ESP32S2
        output["max"] = sensor.gpio() == 17 || sensor.gpio() == 18 ? 255 : 1;
#else
        output["max"] = 1;
#endif
        output["start"] = sensor.uom() == 1 ? "0" : sensor.uom() == 2 ? "1" : "?";
    } else if (sensor.type() == AnalogType::PULSE) {
        output["min"] = 0;
        output["max"] = 1;
    }
}

// this creates the sensor, initializing everything
AnalogSensor::Sensor::Sensor(const uint8_t gpio, const char * name, const double offset, const double factor, const uint8_t uom, const int8_t type, const bool is_system)
    : gpio_(gpio)
    , offset_(offset)
    , factor_(factor)
    , uom_(uom)
    , type_(type)
    , is_system_(is_system) {
    strlcpy(name_, name, sizeof(name_));
    value_ = 0; // init value to 0 always
}

// set the dig_out/counter/DAC/PWM value, id is gpio-no
bool AnalogSensor::command_setvalue(const char * value, const int8_t gpio) {
    float val;
    if (!Helpers::value2float(value, val)) {
        bool b;
        if (!Helpers::value2bool(value, b)) {
            return false;
        }
        val = b ? 1 : 0;
    }

    for (auto & sensor : sensors_) {
        if (sensor.gpio() == gpio) {
            double oldoffset = sensor.offset();
            if (sensor.type() == AnalogType::COUNTER || (sensor.type() >= AnalogType::CNT_0 && sensor.type() <= AnalogType::CNT_2)) {
                if (val < 0 || value[0] == '+') { // sign corrects values
                    // sensor.set_offset(sensor.value() + val);
                    sensor.set_value(sensor.value() + val);
                } else { // positive values are set
                    // sensor.set_offset(val);
                    sensor.set_value(val);
                }
                sensor.set_offset(sensor.value());
                if (sensor.value() != EMSESP::nvs_.getDouble(sensor.name(), 0)) {
                    EMSESP::nvs_.putDouble(sensor.name(), sensor.value());
                }
            } else if (sensor.type() == AnalogType::ADC) {
                sensor.set_offset(val);
            } else if (sensor.type() == AnalogType::RGB) {
                uint32_t v = val;
                sensor.set_offset(v);
                sensor.set_value(v);
                uint8_t r = v / 10000;
                uint8_t g = (v - r * 10000) / 100;
                uint8_t b = v % 100;
                rgb_led::write(sensor.gpio(), 2 * r, 2 * g, 2 * b);
                LOG_DEBUG("RGB set to %d, %d, %d", r, g, b);
            } else if (sensor.type() == AnalogType::PULSE) {
                uint8_t v = val;
                sensor.set_value(v);
                pinMode(sensor.gpio(), OUTPUT);
                digitalWrite(sensor.gpio(), (sensor.offset() != 0) ^ (sensor.value() != 0));
                sensor.polltime_ = sensor.value() != 0 ? uuid::get_uptime() + (sensor.factor() * 1000) : 0;
            } else if (sensor.type() == AnalogType::DIGITAL_OUT) {
                uint8_t v = val;
#if CONFIG_IDF_TARGET_ESP32
                if ((sensor.gpio() == 25 || sensor.gpio() == 26) && v <= 255) {
                    sensor.set_offset(v);
                    sensor.set_value(v);
                    pinMode(sensor.gpio(), OUTPUT);
                    dacWrite(sensor.gpio(), sensor.offset());
                } else
#elif CONFIG_IDF_TARGET_ESP32S2
                if ((sensor.gpio() == 17 || sensor.gpio() == 18) && v <= 255) {
                    sensor.set_offset(v);
                    sensor.set_value(v);
                    pinMode(sensor.gpio(), OUTPUT);
                    dacWrite(sensor.gpio(), sensor.offset());
                } else
#endif
                    if (v == 0 || v == 1) {
                    sensor.set_offset(v);
                    sensor.set_value(v);
                    pinMode(sensor.gpio(), OUTPUT);
                    digitalWrite(sensor.gpio(), (sensor.offset() == 0) ^ (sensor.factor() > 0));
                    if (sensor.uom() == 0 && EMSESP::nvs_.getChar(sensor.name()) != (int8_t)sensor.offset()) {
                        EMSESP::nvs_.putChar(sensor.name(), (int8_t)sensor.offset());
                    }
                }
            } else if (sensor.type() >= AnalogType::PWM_0 && sensor.type() <= AnalogType::PWM_2) {
                if (val > 100) {
                    val = 100;
                } else if (val < 0) {
                    val = 0;
                }
                sensor.set_offset(val);
                sensor.set_value(val);
#if ESP_IDF_VERSION_MAJOR >= 5
                ledcWrite(sensor.gpio(), (uint32_t)(sensor.offset() * 8191 / 100));
#else
                uint8_t channel = sensor.type() - AnalogType::PWM_0;
                ledcWrite(channel, (uint32_t)(val * 8191 / 100));
#endif
            } else {
                return false;
            }
            if (oldoffset != sensor.offset()) {
                publish_sensor(sensor);
                changed_ = true;
            }
            return true;
        }
    }

    return false;
}

} // namespace emsesp